# WireframeBuilder Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireframeBuilder Constructor
WireframeBuilder Class See Also
---
Default constructor.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public WireframeBuilder()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
WireframeBuilder()
```

# See Also
WireframeBuilder Class
Autodesk.Revit.DB Namespace